In [1]:
#Installing and Using Pandas
import pandas
pandas.__version__

'2.2.3'

In [4]:
#Introducing Pandas Objects
import numpy as np
import pandas as pd

In [6]:
#Series
#A Series is a single vector of data(like a Numpy array) with an index that lables each element in the vector
counts=pd.Series([456,1645,564,145])
counts

0     456
1    1645
2     564
3     145
dtype: int64

In [7]:
counts.values

array([ 456, 1645,  564,  145])

In [8]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
bacteria=pd.Series([456,1645,564,145],
    index=['Firmicutes','Proteobacteria','Actinobacteria','Bacteroidetes'])
bacteria

Firmicutes         456
Proteobacteria    1645
Actinobacteria     564
Bacteroidetes      145
dtype: int64

In [11]:
bacteria['Actinobacteria']

np.int64(564)

In [12]:
bacteria[0]

C:\Users\MY PC\AppData\Local\Temp\ipykernel_35484\3591401137.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  bacteria[0]

np.int64(456)

In [13]:
bacteria.name='counts'
bacteria.index.name='phylum'
bacteria

phylum
Firmicutes         456
Proteobacteria    1645
Actinobacteria     564
Bacteroidetes      145
Name: counts, dtype: int64

In [14]:
np.log(bacteria)

phylum
Firmicutes        6.122493
Proteobacteria    7.405496
Actinobacteria    6.335054
Bacteroidetes     4.976734
Name: counts, dtype: float64

In [15]:
bacteria[bacteria>1000]

phylum
Proteobacteria    1645
Name: counts, dtype: int64

In [16]:
bacteria_dict={'Firmicutes':654,'Proteobacteria':4567,'Actinobacteria':654,'Bacteroidetes':154}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 654, 'Proteobacteria': 4567, 'Actinobacteria': 654, 'Bacteroidetes': 154}

Firmicutes         654
Proteobacteria    4567
Actinobacteria     654
Bacteroidetes      154
dtype: int64

In [17]:
#Series as generalized Numpy array
#Series as Specialized Dictionary
#DataFrame:bi-dimensional Series with two (or more) indices
data={"Province":["FL","FL","NH","NH","ZH"],
      "Year":[2013,2014,2015,2013,2014],
      "Literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)      
data=pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2015, 2013, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2015       0.5
3       NH  2013       0.3
4       ZH  2014       0.5

In [20]:
df=pd.DataFrame(data,columns=["Year","province","Literacy"])
df

   Year  province  Literacy
0  2013       NaN       0.2
1  2014       NaN       0.1
2  2015       NaN       0.5
3  2013       NaN       0.3
4  2014       NaN       0.5

In [21]:
df['nonsense']=df.Year/df.Literacy
df

   Year  province  Literacy  nonsense
0  2013       NaN       0.2   10065.0
1  2014       NaN       0.1   20140.0
2  2015       NaN       0.5    4030.0
3  2013       NaN       0.3    6710.0
4  2014       NaN       0.5    4028.0

In [22]:
df['Serie_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Year  province  Literacy  nonsense  Serie_aligned
0  2013       NaN       0.2   10065.0              0
1  2014       NaN       0.1   20140.0              1
2  2015       NaN       0.5    4030.0              2
3  2013       NaN       0.3    6710.0              3
4  2014       NaN       0.5    4028.0              4

In [23]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2015, 3: 2013, 4: 2014},
 'province': {0: nan, 1: nan, 2: nan, 3: nan, 4: nan},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0, 1: 20140.0, 2: 4030.0, 3: 6710.0, 4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [24]:
pd.DataFrame(df.to_dict())

   Year  province  Literacy  nonsense  Serie_aligned
0  2013       NaN       0.2   10065.0              0
1  2014       NaN       0.1   20140.0              1
2  2015       NaN       0.5    4030.0              2
3  2013       NaN       0.3    6710.0              3
4  2014       NaN       0.5    4028.0              4

In [25]:
#DataFrame as Specialized dictionary
#From a list of dicts
data=[{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [26]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [27]:
#From a two-dimensionalNumpy array
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a    8    8
b    8    8
c    8    8